app/Controllers/ProductoController.php

    public function formularioCargarProducto(){
        $categoria = new categoria_model();
        $data['categoria'] = $categoria->findAll();
---
SELECT *
FROM `categoria`

    public function gestionarProducto(){
        $producto = new producto_model();
        $categoria = new categoria_model();
        $data['categoria'] = $categoria->findAll();
        $data['producto'] = $producto->select('producto.*, categoria.descripcion_categoria')
        ->join('categoria', 'categoria.id_categoria = producto.categoria_producto')
        ->findAll();
---
SELECT *
FROM `categoria`
SELECT `producto`.*, `categoria`.`descripcion_categoria`
FROM `producto`
JOIN `categoria` ON `categoria`.`id_categoria` = `producto`.`categoria_producto`

    public function editarProducto($id = null){

        if ($id === null) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('ID de producto no proporcionado');
        }

        $producto = new producto_model();
        $categoria = new categoria_model();

        $data['categoria'] = $categoria->findAll();
        $data['producto'] = $producto->where('id_producto', $id)->first();
---
SELECT *
FROM `categoria`
SELECT *
FROM `producto`
WHERE `id_producto` = '2'
 LIMIT 1

    public function mostrarCatalogo(){
        $producto = new producto_model();
        $data['producto'] = $producto->where('estado_producto', 1)->where('stock_producto>', 0)->join('categoria', 'categoria.id_categoria = producto.categoria_producto')->findAll();
---
SELECT *
FROM `producto`
JOIN `categoria` ON `categoria`.`id_categoria` = `producto`.`categoria_producto`
WHERE `estado_producto` = 1
AND `stock_producto` > 0