app/Controllers/UsuarioController.php

        $contrasenia = $this->request->getPost('contraseña');

        $usuarioModel = new \App\Models\Usuario_model();
        $usuarioData = $usuarioModel->where('usuario', $usuario)->first();
---
SELECT *
FROM `usuario`
WHERE `usuario` = 'admin'
 LIMIT 1