app/Controllers/VentaController.php

    public function verDetalle($id_venta) {

        $venta = new venta_model();
        $detalle = new detalle_venta_model();

        $data['venta'] = $venta->select('venta.*, usuario.nombre_usuario, usuario.apellido_usuario')
            ->join('usuario', 'usuario.id_usuario = venta.cliente_id')
            ->where('id_venta', $id_venta)
            ->first();

        $data['detalle'] = $detalle->select('detalle_venta.*, producto.nombre_producto')
            ->join('producto', 'producto.id_producto = detalle_venta.producto_id')
            ->where('venta_id', $id_venta)
            ->findAll();
---
SELECT `venta`.*, `usuario`.`nombre_usuario`, `usuario`.`apellido_usuario`
FROM `venta`
JOIN `usuario` ON `usuario`.`id_usuario` = `venta`.`cliente_id`
WHERE `id_venta` = '15'
 LIMIT 1
SELECT `detalle_venta`.*, `producto`.`nombre_producto`
FROM `detalle_venta`
JOIN `producto` ON `producto`.`id_producto` = `detalle_venta`.`producto_id`
WHERE `venta_id` = '15'