app/Controllers/VentaController.php

SELECT `venta`.*, `usuario`.`nombre_usuario`, `usuario`.`apellido_usuario`
FROM `venta`
JOIN `usuario` ON `usuario`.`id_usuario` = `venta`.`cliente_id`
---
    public function verVentas(){

        $venta = new venta_model();
        $data['venta'] = $venta->select('venta.*, usuario.nombre_usuario, usuario.apellido_usuario')
        ->join('usuario', 'usuario.id_usuario = venta.cliente_id')
        ->findAll();